var topic=[
    "隊長崩潰 這海選太難了",
    "隊長變卦 選手情緒失控",
    "百強互殺 隊長不忍直視",
    "49強突圍 隊長花式護短",
    "瘋狂24小時齊舞燃炸天",
    "選手叛變 隊長心態崩塌",
    "淚崩! 40強殘殺隊長割肉",
    "大神也有起不來的時候",
    "煙硝四起 12強熱辣出爐",
    "你等的黃景行終於來了！",
    "終極不服冠軍battle對決賽",
    "眾神回歸強勢炸場不涼涼"
];

//var startDate=new Date();
/*
function setMonthAndDay(startMonth,startDay)
{
    startDate.setMonth(startMonth-1,startDay);
    startDate.setHours(0);
    startDate.setMinutes(0);
    startDate.setSeconds(0);
}

setMonthAndDay(4,1);
*/
var date=[
    "2018/02/24",
    "2018/03/03",
    "2018/03/10",
    "2018/03/17",
    "2018/03/24",
    "2018/03/31",
    "2018/04/07",
    "2018/04/14",
    "2018/04/21",
    "2018/04/28",
    "2018/05/05",
    "2018/05/05"
];

var game=[
    "400進100",
    "400進100",
    "100進49",
    "100進49",
    "49進44",
    "44進40",
    "40進28",
    "28進21",
    "21進12 強者突圍賽",
    "12進7 半決賽",
    "決賽",
    "表演賽"
];